<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TitleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::statement("
            INSERT INTO `titles` (`id`, `name_ar`, `name_en`, `created_at`, `updated_at`) VALUES
            (1, 'المدير العام', 'المدير العام', '2021-11-13 11:16:09', '2021-11-13 11:16:09'),
            (2, 'المدير التنفيذى', 'المدير التنفيذى', '2021-11-13 11:16:09', '2021-11-13 11:16:09'),
            (3, 'مدير العمليات', 'مدير العمليات', '2021-11-13 11:16:09', '2021-11-13 11:16:09'),
            (4, 'مهندس موقع', 'مهندس موقع', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (5, 'محاسب', 'محاسب', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (6, 'مدير الحوطة', 'مدير الحوطة', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (7, 'أمين مخزن', 'أمين مخزن', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (8, 'مندوب', 'مندوب', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (9, 'سكرتيره', 'سكرتيره', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (10, 'مسؤل ادارى', 'مسؤل ادارى', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (11, 'مراقب عام', 'مراقب عام', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (12, 'مراقب عمال', 'مراقب عمال', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (13, 'سائق أنكر', 'سائق أنكر', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (14, 'حارس الحوطة', 'حارس الحوطة', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (15, 'ميكانيكى', 'ميكانيكى', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (16, 'حداد', 'حداد', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (17, 'عامل', 'عامل', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (18, 'ميكانيكى أنكر', 'ميكانيكى أنكر', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (19, 'سائق لورى كرين', 'سائق لورى كرين', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (20, 'سائق جى سى بى', 'سائق جى سى بى', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (21, 'سائق باص', 'سائق باص', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (22, 'كهربائى', 'كهربائى', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (23, 'حارس', 'حارس', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (24, 'سائق لوبد', 'سائق لوبد', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (25, 'عامل عادي خفيف', 'عامل عادي خفيف', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (26, 'عامل بناء', 'عامل بناء', '2021-11-13 11:16:10', '2021-11-13 11:16:10'),
            (27, 'مدير المشاريع', 'Projects Manager', '2021-11-21 13:00:14', '2021-11-21 19:13:48');
        ");

    }
}
